
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_resource_group.rg
* Replace
  * module.caseworker-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.judicial-subscription.azurerm_servicebus_subscription.servicebus_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat"
        name       = "rd-aat"
      ~ tags       = {
          - "Destroy Me"          = "No"
          - "Team Contact"        = "#referencedata"
          - "Team Name"           = "ReferenceData"
          - "application"         = "referencedata"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ref-data-support"
          - "environment"         = "staging"
          - "lastUpdated"         = "2025-01-08T10:25:52Z"
          - "managedBy"           = "ReferenceData"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.caseworker-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "rd-caseworker-topic-aat"
      + namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-aat"
      + requires_duplicate_detection            = (known after apply)
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.caseworker-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-aat/topics/rd-caseworker-topic-aat/subscriptions/rd-caseworker-subscription-aat" -> (known after apply)
        name                                      = "rd-caseworker-subscription-aat"
      ~ topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-aat/topics/rd-caseworker-topic-aat" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

  # module.judicial-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_topic" "this" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + enable_batched_operations               = (known after apply)
      + enable_express                          = (known after apply)
      + enable_partitioning                     = (known after apply)
      + id                                      = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "rd-judicial-topic-aat"
      + namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-aat"
      + requires_duplicate_detection            = (known after apply)
      + status                                  = (known after apply)
      + support_ordering                        = (known after apply)
    }

  # module.judicial-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-aat/topics/rd-judicial-topic-aat/subscriptions/rd-judicial-subscription-aat" -> (known after apply)
        name                                      = "rd-judicial-subscription-aat"
      ~ topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.ServiceBus/namespaces/rd-servicebus-aat/topics/rd-judicial-topic-aat" -> (known after apply) # forces replacement
        # (12 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":271,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->